import React from "react";
import "./ads.css";
import pic1 from "./img/a1.jpg";
import pic2 from "./img/a2.jpeg";
import pic3 from "./img/a3.jpg";
import pic4 from "./img/a4.jpg";
import pic5 from "./img/a5.jpg";
import pic6 from "./img/a6.jpg";
import pic7 from "./img/a7.jpg";
import pic8 from "./img/a8.jpg";
import pic9 from "./img/a9.jpg";
import pic10 from "./img/a10.jpg";


export default function Ads () {
    return <> <div className="intro">
    <div className="promo">
        <img src={pic1} alt="" />
        <p className="img-text">26 июля 1941 года в одной из статей газеты "Известия" появилось выражение: "революционная бдительность - одно из важнейших условий организации победы над врагом. Пора понять, что болтун, словоохотливый человек - прямая находка для шпиона, вольный или невольный пособник врага".</p>
    </div>
    <div className="promo">
        <img src={pic2} alt="" />
        <p className="img-text">Сегодня это выражение ассоциируется у нас со знаменитой кинолентой Леонида Гайдая "Операция "Ы" и другие приключения Шурика". Однако еще до выхода картины эта фраза была чрезвычайно популярна в советской публицистике. Начало же было положено В. И. Лениным в статье "О голоде", напечатанной 24 мая 1918 года</p>
    </div>
    <div className="promo">
        <img src={pic3} alt="" />
        <p className="img-text">"Пролетарии всех стран, соединяйтесь!" - один из самых известных коммунистических лозунгов, который присутствовал на государственном гербе СССР с 1958 по1991 год.Карл Маркс и Фридрих Энгельс впервые напечатали его в "Манифесте Коммунистической партии".</p>
    </div>
    <div className="promo">
        <img src={pic4} alt="" />
        <p className="img-text">Впервые этот лозунг появился в мае 1949 года, однако, звучал он несколько иначе: "Мир - миру". Спустя два года на страницах советских газет печатают эту же фразу только в уже известной нам форме.</p>
    </div>
    <div className="promo">
        <img src={pic5} alt="" />
        <p className="img-text">Впервые этот лозунг появился в мае 1949 года, однако, звучал он несколько иначе: "Мир - миру".</p>
    </div>
    </div>
    <div className="intro">
    <div className="promo">
        <img src={pic6} alt="" />
        <p className="img-text">"Пролетарии всех стран, соединяйтесь!" - один из самых известных коммунистических лозунгов, который присутствовал на государственном гербе СССР с 1958 по1991 год. Карл Маркс и Фридрих Энгельс впервые напечатали его в "Манифесте Коммунистической партии".

Догн</p>
    </div>
    <div className="promo">
        <img src={pic7} alt="" />
        <p className="img-text">"Пролетарии всех стран, соединяйтесь!" - один из самых известных коммунистических лозунгов, который присутствовал на государственном гербе СССР с 1958 по1991 год. Карл Маркс и Фридрих Энгельс впервые напечатали его в "Манифесте Коммунистической партии". В Советском Союзе эту фразу изображали на партийных билетах, в заголовках  газет, денежных купюрах и орденах.</p>
    </div>
    <div className="promo">
        <img src={pic8} alt="" />
        <p className="img-text">Эта фраза принадлежит В. И. Ленину и впервые она появилась в его статье "Грозящая катастрофа и как с ней бороться", напечатанной в сентябре 1917 года. Но крылатым это выражение стало после выступления Н. С. Хрущева в 1957 году на зональном совещании работников сельского хозяйства областей и автономных республик СССР.</p>
    </div>
    <div className="promo">
        <img src={pic9} alt="" />
        <p className="img-text">Эта фраза ошибочно приписывается Иосифу Сталину, однако, она не встречается ни в одной его речи и ни в одном сочинении. Некоторые предполагают, что партийные пропагандисты вывели ее из одного из докладов руководителя СССР</p>
    </div>
    <div className="promo">
        <img src={pic10} alt="" />
        <p className="img-text">Их надо без колебаний снимать с руководящих постов, невзирая на их заслуги в прошлом". Ранее же под этим лозунгом вел свою избирательную кампанию будущий американский президент Вудро Вильсон, а позднее лозунг использовал Франклин Рузвельт, борясь с Гербертом Гувером за президентский пост.</p>
    </div>
    </div>
</>}